Тесты утилиты nl. Сравнивалась с nl -b a
Код везде вызыывается через cli1, так как он был так обернут через setuptools.
В output скопирован вывод из консоли.

Из файла:
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""
"""
Output:
"""
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""

"""
Output:
"""
1 
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""


"""
Output:
"""
1 
2 
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""
a
"""
Output:
"""
1 a
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""
ab
cd
"""
Output:
"""
1 ab
2 cd
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""
ab

cd
"""
Output:
"""
1 ab
2 
3 cd
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""

ab
cd
"""
Output:
"""
1 
2 ab
3 cd
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""

ab
cd

"""
Output:
"""
1 
2 ab
3 cd
4
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""


ab

cd

"""
Output:
"""
1 
2 
3 ab
4
5 cd
6
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""
ab
cd
ef
qwe
"""
Output:
"""
1 ab
2 cd
3 ef
4 qwe
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""

a1b
c2356d

sgnf
"""
Output:
"""
1 
2 a1b
3 c2356d
4
5 sgnf
"""
--------------------------------------------------------------------------------
Command: cli1 nl CLI_test.txt
CLI_test.txt:
"""

a1b
c2356d

sgnf


"""
Output:
"""
1 
2 a1b
3 c2356d
4
5 sgnf
6
7
"""
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------

Из Stdin: (pycharm terminal, ^Z = Ctrl Z = EOF)
--------------------------------------------------------------------------------
Command: cli1 nl
"""
^Z
"""
Output:
"""
^Z
"""
--------------------------------------------------------------------------------
Command: cli1 nl
"""

^Z
"""
Output:
"""

    1 
^Z
"""
--------------------------------------------------------------------------------
Command: cli1 nl
"""


^Z
"""
Output:
"""

    1 

    2 
^Z
"""
--------------------------------------------------------------------------------
Command: cli1 nl
"""
a
^Z
"""
Output:
"""
a
    1 a
^Z
"""
--------------------------------------------------------------------------------
Command: cli1 nl
"""
ab
cd
^Z
"""
Output:
"""
ab
    1 ab
cd
    2 cd
^Z
"""
--------------------------------------------------------------------------------
Command: cli1 nl
"""
ab

cd
^Z
"""
Output:
"""
ab
    1 ab

    2 
cd
    3 cd
^Z
"
--------------------------------------------------------------------------------
Command: cli1 nl
"""

ab
cd
^Z
"""
Output:
"""

    1 
ab
    2 ab
cd
    3 cd
^Z
"""
--------------------------------------------------------------------------------
Command: cli1 nl
"""

ab
cd

^Z
"""
Output:
"""

    1 
ab
    2 ab
cd
    3 cd

    4 
^Z
"""
--------------------------------------------------------------------------------
Command: cli1 nl
"""


ab

cd

^Z
"""
Output:
"""

    1 

    2 
ab
    3 ab

    4 
cd
    5 cd

    6 
^Z
"""
--------------------------------------------------------------------------------
Command: cli1 nl
"""
ab
cd
ef
qwe
^Z
"""
Output:
"""
ab
    1 ab
cd
    2 cd
ef
    3 ef
qwe
    4 qwe
^Z
"""
--------------------------------------------------------------------------------
Command: cli1 nl
"""

a1b
c2356d

sgnf
^Z
"""
Output:
"""

    1 
a1b
    2 a1b
c2356d
    3 c2356d

    4 
sgnf
    5 sgnf
^Z
"""
--------------------------------------------------------------------------------
Command: cli1 nl
"""

a1b
c2356d

sgnf


^Z
"""
Output:
"""

    1 
a1b
    2 a1b
c2356d
    3 c2356d

    4 
sgnf
    5 sgnf

    6 

    7 
^Z
"""
--------------------------------------------------------------------------------











